---
kind: other
id: Methods.T:Autodesk.Revit.DB.InsulationLiningBase
source: html/61eddd7a-1092-aab8-9a4e-46c7e503a5fb.htm
---
# InsulationLiningBase Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.